Repository: MOUSSBEKK/HabitoX
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr

# settings_title
source: Settings
de: Einstellungen
es: Ajustes
fr: Paramètres

# language_title
source: Language
de: Sprache
es: Idioma
fr: Langue

# language_system
source: Use device language
de: Gerätesprache verwenden
es: Usar idioma del dispositivo
fr: Langue de l'appareil

# language_english
source: English
de: Englisch
es: Inglés
fr: Anglais

# language_french
source: French
de: Französisch
es: Francés
fr: Français

# language_german
source: German
de: Deutsch
es: Alemán
fr: Allemand

# language_spanish
source: Spanish
de: Spanisch
es: Español
fr: Espagnol

# theme_title
source: Theme
de: Thema
es: Tema
fr: Thème

source: Cancel
de: Abbrechen
es: Cancelar

# onboarding_title
source: Transform your daily life by building lasting habits
de: Verändere deinen Alltag mit dauerhaften Gewohnheiten
es: Transforma tu día a día creando hábitos duraderos
fr: Transformez votre quotidien en construisant des habitudes durables

# onboarding_popup
source: A few minutes a day to change your life
de: Ein paar Minuten am Tag, um dein Leben zu verändern
es: Unos minutos al día para cambiar tu vida
fr: Quelques minutes par jour pour changer votre vie

# onboarding_btn
source: Next
de: Weiter
es: Siguiente
fr: Suivant

# onboarding2_title
source: How does it work?
de: Wie funktioniert es?
es: ¿Cómo funciona?
fr: Comment ça marche ?

# onboarding_title_card1
source: Set your goals
de: Setze deine Ziele
es: Define tus objetivos
fr: Définissez vos objectifs

# onboarding_title_card2
source: Track your progress
de: Verfolge deinen Fortschritt
es: Sigue tu progreso
fr: Suivez vos progrès

# onboarding_title_card3
source: Celebrate your successes
de: Feiere deine Erfolge
es: Celebra tus éxitos
fr: Célébrez vos réussites

# onboarding_subtitles_card1
source: Define the habits you want to develop
de: Definiere die Gewohnheiten, die du entwickeln möchtest
es: Define los hábitos que quieres desarrollar
fr: Définissez les habitudes que vous souhaitez développer

# onboarding_subtitles_card2
source: Mark your daily successes with a simple tap
de: Markiere deine täglichen Erfolge mit einem Tippen
es: Marca tus logros diarios con un simple toque
fr: Marquez vos réussites quotidiennes d'une simple pression

# onboarding_subtitles_card3
source: Unlock achievements and level up your life
de: Schalte Erfolge frei und steige im Level auf
es: Desbloquea logros y sube de nivel
fr: Débloquez des succès et montez de niveau

# onboarding2_btn
source: Get Started
de: Los geht's
es: Empezar
fr: Commencer

source: Home
de: Start
es: Inicio
fr: Accueil

# nav_objectives
source: Objectives
de: Ziele
es: Objetivos
fr: Objectifs

# nav_badges
source: Badges
de: Abzeichen
es: Insignias

# nav_profile
source: Profile
de: Profil
es: Perfil
fr: Profil

# bottom_modal_title
source: New objective
de: Neues Ziel
es: Nuevo objetivo
fr: Nouvel objectif

# bottom_modal_title2
source: Change the objective
de: Ziel ändern
es: Cambiar el objetivo

# bottom_modal_icon
source: Icon
de: Symbol
es: Icono
fr: Icône

# bottom_modal_icon_title
source: Choose an Icon
de: Symbol wählen
es: Elegir un Icono

# bottom_modal_icon_categorie1
source: Sports & Fitness
de: Sport & Fitness
es: Deportes y Fitness

# bottom_modal_icon_categorie3
source: Arts & Creativity
de: Kunst & Kreativität
es: Artes y Creatividad

# bottom_modal_icon_categorie4
source: Learning & Education
de: Lernen & Bildung
es: Aprendizaje y Educación

# bottom_modal_icon_categorie5
source: Technology & Work
de: Technologie & Arbeit
es: Tecnología y Trabajo

# bottom_modal_color
source: Colors
de: Farben
es: Colores
fr: Couleurs

# bottom_modal_color_title
source: Choose a Color
de: Farbe wählen
es: Elegir un Color

# bottom_modal_view
source: View All
de: Alle anzeigen
es: Ver todo
fr: Tout voir

# bottom_modal_input_title
source: Objective title
de: Zieltitel
es: Título del objetivo
fr: Titre de l'objectif

# bottom_modal_placeholder_title
source: Ex: Learn to play the guitar
de: Bsp: Gitarre spielen lernen
es: Ej: Aprender a tocar la guitarra

# bottom_modal_error_title
source: Please enter a title
de: Bitte gib einen Titel ein
es: Por favor ingresa un título

# bottom_modal_input_desc
source: Description
de: Beschreibung
es: Descripción

# bottom_modal_placeholder_desc
source: Describe your goal...
de: Beschreibe dein Ziel...
es: Describe tu objetivo...

# bottom_modal_error_desc
source: Please enter a description
de: Bitte gib eine Beschreibung ein
es: Por favor ingresa una descripción

# bottom_modal_modal_succes
source: Objective successfully modified
de: Ziel erfolgreich geändert
es: Objetivo modificado exitosamente

# bottom_modal_modal_created
source: Goal successfully created
de: Ziel erfolgreich erstellt
es: Objetivo creado exitosamente

# bottom_modal_input_start_date
source: Start date
de: Startdatum
es: Fecha de inicio
fr: Date de début

# bottom_modal_input_start_end
source: End date
de: Enddatum
es: Fecha de fin
fr: Date de fin

# bottom_modal_duration
source: Duration: {duration_days}
de: Dauer: {duration_days}
es: Duración: {duration_days}
fr: Durée : {duration_days}

# bottom_modal_btn
source: Create
de: Erstellen
es: Crear
fr: Créer

# bottom_modal_btn2
source: Edit
de: Bearbeiten
es: Editar

# progression
source: Progress
de: Fortschritt
es: Progreso

source: Calendar progress
de: Kalenderfortschritt
es: Progreso del calendario
fr: Progression du calendrier

# calendar_informations
source: Information
de: Informationen
es: Información
fr: Informations

# calendar_mark_session
source: Mark session
de: Sitzung markieren
es: Marcar sesión
fr: Marquer la session

# calendar_completed_days
source: jours complétés
de: abgeschlossene Tage
es: días completados

# calendar_empty_state
source: No Active Goal
de: Kein aktives Ziel
es: Ningún objetivo activo
fr: Aucun objectif actif

# calender_empty_state_subtitle
source: Create your first goal to start your journey
de: Erstelle dein erstes Ziel, um zu starten
es: Crea tu primer objetivo para iniciar tu camino
fr: Créez votre premier objectif pour démarrer votre parcours

# calendar_loading
source: Chargement du calendrier...
de: Kalender wird geladen...
es: Cargando calendario...

# objectives_actif
source: Active
de: Aktiv
es: Activos
fr: Actifs

# objectives_completed
source: Completed
de: Abgeschlossen
es: Completados
fr: Terminés

# objectives_archived
source: Archived
de: Archiviert
es: Archivados
fr: Archivés

# objectives_actif_empty_title
source: No Active Target
de: Keine aktiven Ziele
es: Ningún objetivo activo
fr: Aucun objectif actif

# objectives_actif_empty_subtitle
source: Start by creating your first goal!
de: Beginne mit deinem ersten Ziel!
es: ¡Empieza creando tu primer objetivo!
fr: Commencez par créer votre premier objectif !

# objectives_completed_empty_title
source: No Objectives Completed
de: Keine abgeschlossenen Ziele
es: Ningún objetivo completado
fr: Aucun objectif terminé

# objectives_completed_empty_subtitle
source: Complete your goals to see them here
de: Schließe Ziele ab, um sie hier zu sehen
es: Completa tus objetivos para verlos aquí
fr: Terminez vos objectifs pour les voir ici

# objectives_archived_empty_title
source: No Archived Objectives
de: Keine archivierten Ziele
es: Ningún objetivo archivado
fr: Aucun objectif archivé

# objectives_archived_empty_subtitle
source: Archive your goals to organize them
de: Archiviere deine Ziele, um sie zu organisieren
es: Archiva tus objetivos para organizarlos
fr: Archivez vos objectifs pour les organiser

# objectives_informations
source: Series
de: Serien

# objectives_informations2
source: Best
de: Beste
es: Mejor

# objectives_popup1
source: Stop
de: Stoppen
es: Detener

# objectives_popup2
source: Activate
de: Aktivieren
es: Activar

# objectives_popup3
source: Supprimer
de: Löschen
es: Eliminar

# objectives_popup4
source: Edit
de: Bearbeiten
es: Editar

# badge_earned
source: Latest Badge Earned
de: Zuletzt erhaltenes Abzeichen
es: Última insignia obtenida
fr: Dernier badge obtenu

# badge1_title
source: First Seed
de: Erster Samen
es: Primera Semilla
fr: Débutant

# badge2_title
source: Growing Roots
de: Wachsende Wurzeln
es: Raíces Creciendo
fr: Déterminé

# badge3_title
source: Strong Foundation
de: Solides Fundament
es: Base Sólida
fr: Élite

# badge4_title
source: Routine Master
de: Routine-Meister
es: Maestro de Rutina
fr: Maître

# badge5_title
source: Habit Champion
de: Gewohnheits-Champion
es: Campeón de Hábitos
fr: Champion

# badge6_title
source: Forest Guardian
de: Waldhüter
es: Guardián del Bosque
fr: Légende

# badge7_title
source: Wisdom Tree
de: Weisheitsbaum
es: Árbol de Sabiduría
fr: Haut rang

# badge8_title
source: Life Transformer
de: Lebensverwandler
es: Transformador de Vida
fr: Haut rang

# badge9_title
source: Habit Sage
de: Gewohnheits-Weiser
es: Sabio de Hábitos
fr: Transcendant

# badge1_desc
source: You've planted your first habit.
de: Du hast deine erste Gewohnheit gepflanzt.
es: Has plantado tu primer hábito.
fr: Bienvenue dans votre aventure HabitoX !

# badge2_desc
source: Your routines are taking shape
de: Deine Routinen nehmen Gestalt an
es: Tus rutinas están tomando forma
fr: Votre détermination commence à porter ses fruits !

# badge3_desc
source: Your habits are well established
de: Deine Gewohnheiten sind gut etabliert
es: Tus hábitos están bien establecidos
fr: Vous faites partie de nos utilisateurs d'élite !

# badge4_desc
source: Your consistency is bearing fruit
de: Deine Beständigkeit trägt Früchte
es: Tu constancia está dando frutos
fr: Votre maîtrise du sujet est exceptionnelle !

# badge5_desc
source: You inspire others with your dedication
de: Du inspirierst andere mit deiner Hingabe
es: Inspiras a otros con tu dedicación
fr: Vous êtes un véritable champion !

# badge6_desc
source: You protect and nurture multiple habit trees
de: Du schützt und nährst mehrere Gewohnheitsbäume
es: Proteges y nutres múltiples árboles de hábitos
fr: Votre légende inspire les autres !

# badge7_desc
source: Your habits have grown into ancient wisdom
de: Deine Gewohnheiten sind zu alter Weisheit gewachsen
es: Tus hábitos han crecido en sabiduría antigua
fr: Atteignez le niveau 50 pour ce badge !

# badge8_desc
source: Your consistency has transformed your entire life
de: Deine Beständigkeit hat dein ganzes Leben verwandelt
es: Tu constancia ha transformado toda tu vida
fr: Atteignez le niveau 60 pour ce badge !

# badge9_desc
source: You've mastered the art of lasting change
de: Du hast die Kunst dauerhafter Veränderung gemeistert
es: Has dominado el arte del cambio duradero
fr: Atteignez le niveau 70 pour ce badge !

# upgrade_card_title
source: Upgrade Plan Now
de: Plan jetzt upgraden
es: Mejorar plan ahora
fr: Passer au plan supérieur

# upgrade_card_subtitle
source: Enjoy all the benefits and explore more possibilities
de: Genieße alle Vorteile und entdecke mehr Möglichkeiten
es: Disfruta de todos los beneficios y explora más posibilidades
fr: Profitez de tous les avantages et explorez plus de possibilités

# settings_appearance
source: App Appearance
de: App-Erscheinungsbild
es: Apariencia de la app
fr: Apparence de l'application

# settings_categorie_prefetence
source: Preferences
de: Präferenzen
es: Preferencias

# settings_categorie_ressources
source: Resources
de: Ressourcen
es: Recursos

# settings_notifications
source: Notifications
de: Benachrichtigungen
es: Notificaciones

# settings_data_analytics
source: Data & Analytics
de: Daten & Analysen
es: Datos y análisis
fr: Données & Analyses

# settings_language
source: Language
de: Sprache
es: Idioma
fr: Langue

# settings_import
source: Import
de: Importieren
es: Importar
fr: Importer

# settings_export
source: Export
de: Exportieren
es: Exportar
fr: Exporter

# settings_privacy_policy
source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de privacidad
fr: Politique de confidentialité

# settings_rate_app
source: Rate the app
de: App bewerten
es: Valorar la app
fr: Noter l'application

# settings_follow_instagram
source: Follow on Insta
de: Auf Insta folgen
es: Seguir en Insta
fr: Suivre sur Insta

# premium_monthly
source: Monthly
de: Monatlich
es: Mensual
fr: Mensuel

# premium_annual
source: Annual
de: Jährlich
es: Anual
fr: Annuel

# premium_life
source: For life
de: Lebenslang
es: De por vida
fr: À vie

# premium_subscribe_subtitle
source: Recurring billing. Cancel anytime
de: Wiederkehrende Abrechnung. Jederzeit kündbar
es: Facturación recurrente. Cancela en cualquier momento
fr: Facturation récurrente. Annulation à tout moment

# premium_paiement_subtitle
source: Pay Once. Unlimited access forever
de: Einmal zahlen. Unbegrenzter Zugriff für immer
es: Paga una vez. Acceso ilimitado para siempre
fr: Paiement unique. Accès illimité à vie

# premium_feature_title
source: By subscribing, you will also unlock:
de: Mit dem Abo schaltest du außerdem frei:
es: Al suscribirte, también desbloquearás:
fr: En vous abonnant, vous débloquerez aussi :

# premium_feature_title1
source: Access imports and exports
de: Zugriff auf Importe und Exporte
es: Acceso a importaciones y exportaciones
fr: Accès aux imports et exports

# premium_feature_title2
source: Widget on the home screen
de: Widget auf dem Startbildschirm
es: Widget en la pantalla de inicio
fr: Widget sur l’écran d’accueil

# premium_feature_title3
source: Access to charts and statistics
de: Zugriff auf Diagramme und Statistiken
es: Acceso a gráficos y estadísticas
fr: Accès aux graphiques et statistiques

# premium_feature_title4
source: Custom badges
de: Individuelle Abzeichen
es: Insignias personalizadas
fr: Badges personnalisés

# premium_feature_title1_desc
source: Back up or migrate your data with ease
de: Sichere oder migriere deine Daten ganz einfach
es: Respalda o migra tus datos fácilmente
fr: Sauvegardez ou migrez vos données facilement

# premium_feature_title2_desc
source: Access your favorite habits from the home screen
de: Greife vom Startbildschirm auf deine Lieblingsgewohnheiten zu
es: Accede a tus hábitos favoritos desde la pantalla de inicio
fr: Accédez à vos habitudes favorites depuis l’écran d’accueil

# premium_feature_title3_desc
source: View your trends and consistency
de: Sieh dir deine Trends und Beständigkeit an
es: Visualiza tus tendencias y constancia
fr: Visualisez vos tendances et votre régularité

# premium_feature_title4_desc
source: Unique rewards tailored to your goals
de: Einzigartige Belohnungen, die zu deinen Zielen passen
es: Recompensas únicas adaptadas a tus objetivos
fr: Récompenses uniques adaptées à vos objectifs

# premium_btn
source: Continue
de: Weiter
es: Continuar
fr: Continuer

# notification_title
source: Daily reminders
de: Tägliche Erinnerungen
es: Recordatorios diarios

# notification
source: Do not forget to complete your task.
de: Vergiss nicht, deine Aufgabe zu erledigen.
es: No olvides completar tu tarea.

# notification_subtitle
source: Get a daily notification so you don't forget to complete your goals.
de: Erhalte täglich eine Benachrichtigung, damit du deine Ziele nicht vergisst.
es: Recibe una notificación diaria para no olvidar completar tus objetivos.

# notification_toggle_title
source: Turn on notifications
de: Benachrichtigungen aktivieren
es: Activar notificaciones

# notification_toggle_on_subtitle
source: Notifications are enabled
de: Benachrichtigungen sind aktiviert
es: Las notificaciones están activadas

# notification_toggle_off_subtitle
source: Notifications are disabled
de: Benachrichtigungen sind deaktiviert
es: Las notificaciones están desactivadas

source: Notification time
de: Benachrichtigungszeit
es: Hora de la notificación

# notification_choose_time
source: Choisissez à quelle heure vous souhaitez recevoir votre rappel quotidien.
de: Wähle die Uhrzeit für deine tägliche Erinnerung.
es: Elige a qué hora deseas recibir tu recordatorio diario.

# notification_select_time
source: Time modified
de: Uhrzeit geändert
es: Hora modificada

# notification_perms
source: Required permissions
de: Erforderliche Berechtigungen
es: Permisos requeridos

# notification_perms_subtitle
source: To receive notifications, you must allow the app to send you notifications in your device settings.
de: Um Benachrichtigungen zu erhalten, musst du der App erlauben, Benachrichtigungen in den Geräteeinstellungen zu senden.
es: Para recibir notificaciones, debes permitir que la app te envíe notificaciones en los ajustes de tu dispositivo.

# analytics_completions
source: Completions
de: Abschlüsse
es: Completados

# analytics_archives
source: Archived
de: Archiviert
es: Archivados

# analytics_completions_day
source: Completions / Day
de: Abschlüsse / Tag
es: Completados / día

# analytics_marking_omissions
source: Markings vs. Omissions
de: Markierungen vs. Auslassungen
es: Marcados vs. Omisiones

# analytics_marking
source: Markings
de: Markierungen
es: Marcados

# analytics_omissions
source: Forget
de: Auslassungen
es: Omisiones

# analytics_nodata
source: No data
de: Keine Daten
es: Sin datos

# toastification_privacy_error
source: Unable to open the privacy policy
de: Datenschutzrichtlinie kann nicht geöffnet werden
es: No se puede abrir la política de privacidad

# toastification_insta_error
source: Unable to open Instagram
de: Instagram kann nicht geöffnet werden
es: No se puede abrir Instagram

# toastification_review
source: Thank you for your feedback.
de: Danke für dein Feedback.
es: Gracias por tu comentario.

# toastification_error_title
source: Error
de: Fehler

# toastification_error_desc
source: Unable to open the rating. Redirecting to the store...
de: Bewertung kann nicht geöffnet werden. Weiterleitung zum Store...
es: No se puede abrir la valoración. Redirigiendo a la tienda...

# toastification_error_redirecting_desc
source: Unable to open the store. Please note the app manually.
de: Store kann nicht geöffnet werden. Bitte bewerte die App manuell.
es: No se puede abrir la tienda. Por favor, valora la app manualmente.

# toastification_session_completed
source: Session marked as completed
de: Sitzung als abgeschlossen markiert
es: Sesión marcada como completada

# toastification_goal_completed
source: Goal Completed
de: Ziel Abgeschlossen
es: Objetivo Completado

# badge_level
source: Level
es: Nivel
fr: Niveau

# settings_app_updates
source: App Updates
es: Actualizaciones de la app
fr: Mises à jour de l'app
